[
{"datetime": "5 days ago", "title": "AMZN crashes -18% after hours with Q3 earnings release", "content": ["Shares of Amazon plunged as much as 20% in extended trading on Thursday after the company posted weaker-than-expected earnings and revenue for the third quarter and gave a disappointing fourth-quarter sales forecast.", "-EPS prints at $0.28 vs. $0.22 expected.", "-Revenues came in at $127.1B vs. $127.5B eyed.", "-", "More details here:"], "upvotes": "5.0k", "link": "https://www.reddit.com/r/stocks/comments/yf1ztd/amzn_crashes_18_after_hours_with_q3_earnings/"},
{"datetime": "7 days ago", "title": "Adidas to End Kanye West Partnership After Controversies; Adidas: was “one of the most successful collaborations in our industry's history\"", "content": ["Adidas AG plans to end its partnership with Kanye West following a rash of offensive behavior from the rapper and designer that turned a once-thriving shoe brand into a lightning rod for criticism.", "The German sports company may announce the move as early as Tuesday, according to people familiar with the matter, who asked not to be identified because discussions are private. A representative for Adidas didn’t immediately respond to requests for comment.", ". The rapper has made controversial statements, including antisemitic social media posts in recent weeks, and has moved to cut ties with his corporate partners. Ye couldn’t immediately be reached for comment.", ", according to several estimates from Wall Street analysts.", "The German company is of the view that it owns the intellectual property rights to the products from the collaboration and could continue producing the models, one of the people said.", " and said it will continue co-managing Yeezy products during its review."], "upvotes": "3.2k", "link": "https://www.reddit.com/r/stocks/comments/yd0eo8/adidas_to_end_kanye_west_partnership_after/"},
{"datetime": "3 days ago", "title": "Twitter will be delisted from the New York Stock Exchange on November 8", "content": ["Twitter's stock will be delisted from the New York Stock Exchange on November 8, according to a new filing with the U.S. Securities and Exchange Commission. This comes a day after Elon Musk completed ", " late Thursday. Incidentally, the delisting is taking place on the same date as the U.S. midterm elections.", "\"The New York Stock Exchange hereby notifies the SEC of its intention to remove the entire class of the stated securities from listing and registration on the Exchange at the opening of business on November 08, 2022, pursuant to the provisions of Rule 12d2-2 (a),\" the ", ".", "It also indicated that ", " between Twitter and Musk's subsidiary X Holdings II, Inc. was complete. Musk's X Holdings I, Inc. will now own all the stock of the social network.", "\"The merger between Twitter, Inc. and X Holdings II, Inc., a wholly owned subsidiary of X Holdings I, Inc., wholly owned by Elon R. Musk became effective on October 27, 2022. Each share of Twitter, Inc. Common Stock was exchanged for USD 54.20 in cash, without interest and less any applicable withholding taxes. The Exchange also notifies the Securities and Exchange Commission that as a result of the above-indicated conditions this security was suspended from trading before market open on October 28, 2022.\"", "At the time of writing, Twitter's stock was trading at $53.70 — slightly lower than Musk's buying price of $54.20. Twitter won't have to make quarterly disclosures like its monthly active users or its earnings as a private company. But financial institutions that have lent money to Musk will pressure the billionaire to make the company profitable.", "The social media company will likely form a new board after the current members will dissolve. Musk will have to also pick a new executive team, as one of his first steps after taking over was to ", ". Musk is ", " for the time being, but he might hand it over to someone else in the long run.", "A report from ", " noted that Agrawal is set to receive nearly $50 million while Segal and Gadde will get $37 million and $17 million each as part of the severance package.", "While the Tesla CEO squashed rumors ", ", the current set of employees are still ", "."], "upvotes": "2.0k", "link": "https://www.reddit.com/r/stocks/comments/yg7bv9/twitter_will_be_delisted_from_the_new_york_stock/"},
{"datetime": "7 days ago", "title": "Google misses on expectations as YouTube ad revenue comes up short, stock down 5%", "content": ["📷Scroll back up to restore default view.📷", "Google parent Alphabet reported its Q3 earnings on Tuesday falling short of analysts' expectations on the top and bottom line, as YouTube advertising revenue came up short.", "These are the most important numbers from the report compared to what Wall Street was expecting of the company, as compiled by Bloomberg.", "The digital advertising market has been struck by a slowdown in spending in the past few quarters, as companies pull back their budgets amid rising inflation and interest rates."], "upvotes": "1.9k", "link": "https://www.reddit.com/r/stocks/comments/ydep0c/google_misses_on_expectations_as_youtube_ad/"},
{"datetime": "4 days ago", "title": "Apple today is a good example why the markets are so hard.", "content": ["Whenever there's a large upside or downside move in the markets, everyone's thoughts are, \"Why did the markets go up/down today?\"", "And there are a myriad of reasons why. But at the end of the day, the simplest and truest answer is, \"Because there were more buyers than sellers\" (or vice versa).", "Apple's earnings yesterday was definitely a sigh of relief for investors, cinching a much needed win in this week of big-tech earnings misses.", "However, does it deserve a ~8% upside move in a single day? I don't know, but that's a $200 billion move in market cap, larger than any company outside of the top 50 largest companies globally. Don't quote me on this, but I think this is probably the biggest percentage day gain for $AAPL in more than 10 years. Interesting.", "Some folks think the move was exacerbated by today being EOY for mutual funds, so maybe there's a large one-sided buying skew from big fund positioning. Other folks think that it's just another day of a gamma-squeeze with 0 DTE calls being hammered all day long. Maybe the earnings was really THAT good in the grand scheme of big tech earnings misses this quarter. At the end of the day, trying to find rhyme or reason for moves on a single day basis will drive you mad. Trying to find rhyme or reason for moves on a weekly basis will also drive you mad.", "With all that being said, what's peculiar about this situation is that $AAPL now is the most expensive it's ever been relative to the NASDAQ 100. While trying to find reasons for moves in markets is impossible, what is understandable is the ebb and flow of markets during a bear market. Similarly to the dot-com bubble, you had the trashiest stocks implode many months before the rest of the market tanked. Before full capitulation happened, there was a flight to safety in big-cap tech stocks as well. In bear markets like these, it's human nature to preserve what you have and \"fly\" to safety. Apple is the safety net everyone is flocking to, and I believe it will be painful.", "Full disclaimer, I've been bearish all year, but bullish over the past couple weeks. Earlier this week I actually thought THE bottom might be in for markets, and the worst had probably come. But today's move in $AAPL has changed my view and I now believe there is still one last shoe to drop soon in the markets.", "There is currently a bubble in \"safe\" value large-cap stocks, and I believe this cohort will drive the overall market lower over the next few months. Apple is the ring-leader, but there are several others that at interesting valuations. (I personally think buying beaten-down growth tech is much more attractive than these). Altria ($MO) 47 P/E, Clorox ($CLX) 38 P/E, Kraft Heinz ($KHC) 38 P/E, Colgate-Palmolive ($CL) 32 P/E, Hershey ($HSY) 30 P/E, PepsiCo ($PEP) 26 P/E. These are brands we all know, and they are trading at eye-watering levels, driven by a \"flight to safety\" by big funds who have no choice during this year's turmoil.", "I think the moves in these \"value\" stocks can be attributed to a single philosophy that I've heard from folks who were fund managers in a different generation. \"You won't be fired for buying IBM\". Underperforming the benchmark because you invested in risky stocks like $CVNA and $W? Fired. Underperforming the benchmark because you invested in quality stocks like $CLX and $PEP? You'll still have your job."], "upvotes": "1.8k", "link": "https://www.reddit.com/r/stocks/comments/yfwujj/apple_today_is_a_good_example_why_the_markets_are/"},
{"datetime": "5 days ago", "title": "U.S. GDP accelerated at 2.6% pace in Q3, better than expected as growth turns positive", "content": ["The U.S. economy posted its first period of positive growth for 2022 in the third quarter, at least temporarily easing inflation fears, the Bureau of Economic Analysis reported Thursday.", "GDP, a sum of all the goods and services produced from July through September, increased at a 2.6% annualized pace for the period, against the Dow Jones estimate for 2.3%.", "That reading follows consecutive negative quarters to start the year, meeting a commonly accepted definition of recession, though the National Bureau of Economic Research is generally considered the arbiter of downturns and expansions."], "upvotes": "1.3k", "link": "https://www.reddit.com/r/stocks/comments/yeqt68/us_gdp_accelerated_at_26_pace_in_q3_better_than/"},
{"datetime": "6 days ago", "title": "Meta earnings are out - Here are the numbers", "content": ["Facebook parent ", " reported earnings after the bell. Here are the results.", "Earnings per share (EPS): $1.64 vs $1.89 expected, according to Refinitiv", "Revenue: 27.71 billion vs. $27.38 billion expected, according to Refinitiv", "Daily Active Users (DAUs): 1.98 billion vs 1.98 billion expected, according to StreetAccount", "Monthly Active Users (MAUs): 2.96 billion vs 2.94 billion expected, according to StreetAccount", "Average Revenue per User (ARPU): $9.32 expected, according to StreetAccount", "Facebook’s parent is contending with a broad slowdown in online ad spending, challenges from ", " iOS privacy update and increased competition from TikTok. Add it up, and Meta is expected to post its second straight quarter of ", ".", "Although Meta is investing heavily in its Reels short-video service to steer users away from TikTok, the product is in the early days of generating revenue and isn’t as lucrative as Facebook’s core features, like Stories and the newsfeed.", "Meta is trying to make Reels more attractive to advertisers and has announced new ad formats intended to give businesses enhanced options for promoting their products through short videos. The company also recently ", " new ways for companies to advertise on Instagram and Messenger, padding its overall ad inventory, which could potentially bolster overall sales."], "upvotes": "1.2k", "link": "https://www.reddit.com/r/stocks/comments/ye7m0f/meta_earnings_are_out_here_are_the_numbers/"}
]